<template>
	<view class="wxParse">
		<rich-text class="custom-rich-text" :nodes="content"></rich-text>
	</view>
</template>

<script setup>
	import {
		ref
	} from 'vue';
	const content = ref(
		' <p>尊敬的用户，欢迎您使用&ldquo;陕易通陕西高速公路智慧出行&rdquo;平台（简称&ldquo;陕易通&rdquo;）。</p>    <p>本平台由陕西交控科技发展集团股份有限公司（简称&ldquo;陕西交控科技&rdquo;或&ldquo;我们&rdquo;）所有和运营。在登录、使用本平台之前，您应当仔细阅读、充分理解《用户服务协议》（简称&ldquo;本协议&rdquo;）的全部内容，<strong>特别是本协议中以加粗字体显示的内容，您应当重点阅读。如果您不同意本协议或其中任何条款，请您立即停止登录或使用本平台；您开始登录或使用本平台，即表明您已同意本协议内容，本协议即构成对用户和陕西交控科技（合称&ldquo;双方&rdquo;）有约束力的法律文件。</strong></p>    <p><strong>第一条 定义</strong></p>    <p>1.1 本平台：是指由陕西交控科技发展集团股份有限公司所有并负责运营的&ldquo;陕易通陕西高速公路智慧出行&rdquo;平台。</p>    <p>1.2 所有权以及相关的权利：在本协议中是指：第一，所有权；第二，知识产权，包括但不限于著作权、专利权、商标权、商业秘密等；第三，除上述权利之外的对物、信息及其载体和表现形式的使用、利用、传播、复制、发行、编辑、修改、处分等权利。</p>    <p>1.3 用户：是指接受本平台服务的自然人、法人或其他组织。</p>    <p>1.4 个人信息：在本协议中，是指以电子或者其他方式记录的能够单独或者与其他信息结合识别用户身份或者反映用户活动情况的各种信息。</p>    <p>1.5 网络服务：是指本平台基于互联网方式向用户提供的用户车辆绑定、车辆信息查询、政策宣传、积分查询查询、业务办理、积分兑换、路况查询等服务。</p>  <p>1.6 &nbsp;平台内经营者：是指除陕西交控科技以外的、通过本平台提供积分兑换商品或者提供服务的第三方经营者。</p>    <p><strong>第二条 网络服务内容</strong></p>    <p>2.1 本平台向用户提供的网络服务包括：</p>   <p>用户注册、登录、安全退出、找回密码、修改密码、基本资料修改、历史信息查询等服务；车辆绑定、车辆信息查询、业务办理、路况查询等服务；积分兑换服务；对本平台用户进行验证消息推送，通过12122端口短信消息与微信通知进行通知服务；本平台为用户提供的其他服务。</p>    <p>2.2 本平台有权根据情况变化调整网络服务的具体内容，本平台服务内容进行调整的，无需另行通知用户，调整后的内容一经发布即自动生效。如用户不同意上述调整，应当立即停止使用服务；如用户继续使用服务，视为用户同意调整后的内容并同意遵守。</p>    <p>2.3 本平台仅提供服务，与服务有关的积分兑换的礼品由平台内经营者自行承担。</p>    <p>2.4 用户使用本平台提供的具体服务时，应当满足相应的前提条件、具备相应的服务使用权限。用户不满足使用服务的前提条件、不具备服务使用权限的，无法使用相应服务。</p>    <p>2.5 用户使用本平台提供的基础功能服务的，应当同时遵守用户与本平台另行签订的相应服务协议。</p>    <p><strong>第三条 用户账号管理</strong></p>    <p><strong>3.1 用户授权，用户注册、登录以及实际使用本平台提供的服务时，应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。如用户不具备前述主体资格，则用户及用户的监护人应当依照法律规定承担因此而导致的一切后果，陕西交控科技有权注销或永久冻结用户的账户。</strong></p>    <p>3.2 用户按照本平台要求的程序进行注册，获得在本平台的账号，登录本平台；按照本注册程序获得本平台账号的用户，可以在登录后通过&ldquo;个人中心&rdquo;进行注册信息的变更及注销。</p>    <p>3.3 用户使用具体服务时，本平台可能会要求用户完成进一步激活或验证流程，用户应当按照相应页面的提示提供身份信息及资料(包括但不限于手机号码、车牌信息、行驶证照片等)，并应保证提供的身份信息及资料真实、及时、完整和准确。</p>    <p><strong>3.4 用户在本平台的账号、车牌号、短信随机验证码等是用户在本平台的唯一身份权证。为享受本平台提供的查询服务，用户应当按照对应的服务要求键入正确的用户账号或短信验证码或其他身份信息。</strong></p>    <p><strong>3.5 用户应妥善保管用户账号、车牌号、ETC账号和手机短信验证码。用户在服务使用过程中可以根据本平台规定更改账户。用户账号不得出借、转让、继承或者赠与。因非本平台原因导致用户的账号丢失或被他人窃取的，本平台不承担责任。如果用户发现自己的个人信息泄密，尤其是本平台账户及个人信息发生泄露，请立即联络本平台。</strong></p>    <p><strong>3.6 用户通过账号、车牌号/或手机短信验证码登录后使用本平台的行为，均视为用户本人行为，用户应当承担由此导致的相关后果和责任。</strong></p>    <p>3.7 用户登录后，可以设置用户在本平台的昵称。用户账号、昵称应当符合法律法规规定，不得违反法律法规规定、侵犯或涉嫌侵犯他人合法权益，否则，本平台有权暂停或终止提供本平台的所有服务，并冻结用户账号。</p>    <p><strong>第四条 积分商品兑换服务规则</strong></p>    <p>4.1 用户可以使用本平台提供的积分商品兑换服务，可以通过本平台积分兑换平台内经营者提供的商品和服务（统称&ldquo;商品&rdquo;）。</p>   <p>4.2 对于平台内经营者提供的商品，本平台依法履行平台责任，同时用户应当遵守与平台内经营者之间的约定，陕西交控科技不参与平台内经营者与用户之间的兑换或服务过程，不对平台内经营者的供货行为（包括但不限于发布商品信息、积分兑换额度、商品配送、售后服务等）的合法性、真实性、有效性作任何明示和默示的担保，亦不对由此产生的后果承担法律责任。</p>    <p>4.3 用户应当按照本协议约定订购商品。用户订购商品时，应当仔细确认所兑换商品的名称、价格、数量、型号、联系地址、电话、收货人等信息。收货人与用户本人不一致的，收货人/用户的行为和意思表示视为用户/收货人的行为和意思表示，用户/收货人应对收货人/用户的行为及意思表示的法律后果承担连带责任。</p>    <p><strong>4.4用户可在行程结束后48小时内获取自己当日的总里程数与总里程对应换算的积分数，用户同意本平台获取用户行驶里程数据并接受换算积分或里程统计过程中存在误差，用户若存在异议可通过客服反馈，由系统重新核算结果并在7日内给出处理意见；</strong></p>    <p><strong>由于系统迁移引起的数据误差，用户若存在异议可通过客服反馈，由系统重新核算结果并在7日内给出处理意见。</strong></p>    <p>4.5 平台内经营者作为商品供货方时应当按照本协议约定向用户提供兑换商品。商品供货方将会按照与用户的约定将用户兑换的商品送到其所指定的送货地址，配送期间产生的物流费用由用户自行承担。所有在本平台上列出的送货时间为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。用户应当清楚准确地填写真实姓名、送货地址及联系方式。因如下情况造成订单延迟或无法配送等，商品供货方不承担迟延配送的责任：</p>   <p>(1)用户提供错误信息和不详细的地址；</p>    <p>(2)货物送达无人签收，由此造成的重复配送所产生的费用及相关的后果；</p>    <p>(3)不可抗力，例如：自然灾害、交通戒严、突发战争等；</p>    <p>(4)法定及特殊节假日期间，物流商无法正常配送的。</p>    <p><strong>第五条 用户的权利和义务</strong></p>    <p>5.1 用户使用本协议项下服务，应当遵守《中华人民共和国网络安全法》《中华人民共和国计算机信息网络国际联网暂行规定》和其他有关法律、法规或相关规定、以及本协议的约定，不得存在任何违法违规行为，不得侵犯本平台以及任何第三方的合法权益。</p>    <p><strong>5.2 在遵守本协议的前提下，用户有权使用本平台提供的功能服务。用户同意通过短信消息与微信通知接收服务通知、路况播报、里程通知、积分通知等服务的相关信息。如用户不愿意接受相关信息，可以按照短信消息中退订提示进行退订。</strong></p>    <p><strong>5.3 本平台所提供的网络服务部分功能需要获得用户授权终端设备的部分信息方可正常使用；本平台按照相关法律法规，以最小化权限原则、区分网络服务场景进行授权获取的提示。用户有权不同意</strong><strong>也可以撤回同意</strong><strong>，但可能会影响本平台或相应网络服务的正常使用。</strong></p>    <p>5.4 用户承诺使用网络服务应当符合国家法律法规的规定，且行为符合下列要求：</p>    <p>(1)不干扰本平台的正常运转，不进行任何破坏或试图破坏网络安全的行为，不进行任何改变或试图改变本平台系统配置或破坏系统安全的行为，不得侵入本平台及国家计算机信息系统；</p>    <p>(2)不对本平台展示或提供的、由陕西交控科技所有的任何数据或信息作商业性利用，包括但不限于在未经陕西交控科技事先书面同意的情况下，以复制、传播等任何方式使用本平台展示或提供的、陕西交控科技所有的资料、信息、数据等；</p>    <p>(3)不模仿、修改、翻译、改编、出借、出售、转许可、传播或转让本平台提供的服务，也不得逆向工程、反汇编、反编译、分解拆卸或试图以其他方式发现本平台提供的服务的源代码；</p>    <p>(4)不发送、上传和储存带有病毒的、蠕虫的、木马和其他有害内容的计算机代码、文件、脚本和程序；</p>    <p>(5)遵守所有使用网络服务的网络协议、规定、程序和惯例；</p>    <p>(6)不从事其他违反法律法规规定或双方约定的行为。</p>    <p>5.5 用户不得通过本平台制作、复制、发布、传播含有下列内容的信息：</p>    <p>（1）反对宪法所确定的基本原则的；</p>    <p>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>    <p>（3）损害国家荣誉和利益的；</p>    <p>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</p>    <p>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</p>    <p>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</p>    <p>（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>    <p>（8）侮辱或者诽谤他人，侵害他人合法权益的；</p>    <p>（9）含有法律、行政法规禁止的其他内容的。</p>    <p><strong>5.6 若用户存在违反法律规定或本协议约定的任一情形，本平台有权按相关规定暂停或终止提供服务，保存有关记录，并向政府主管部门报告，由此引起的一切后果和责任由用户负责。同时，陕西交控科技有权终止本协议，并不承担任何责任。</strong></p>    <p>5.7 用户违反本协议使用网络服务导致本平台内经营者损失的，应当承担相应法律责任、赔偿本平台内经营者的损失。</p>    <p><strong>第六条 本平台的权利和义务</strong></p>    <p>6.1 任何本平台所发布的信息及/或其载体，及/或其表现形式，及/或服务，除以下情况之外，其所有权及相关的权利均独占性地属于本平台所有：</p>    <p>(1)依据相关法律规定该信息及/或载体，及/或服务，不享有所有权以及与此相关的权利的；</p>    <p>(2)依据陕西交控科技授权平台运营方和其他主体之间的协议、合同、章程，由平台运营方和其他主体共享，或其他主体单独享有或陕西交控科技转让的；</p>    <p>(3)依据平台运营方具有法律效力的正式声明而放弃的。</p>    <p>6.2 非经平台运营方及/或授权其使用的第三方权利人书面同意，用户不得擅自使用本平台内容，且无权擅自复制、修改这些内容，或创造与内容有关的派生产品。任何对本平台享有的基于该信息及/或其载体，及/或其表现形式，及/或服务的权利的侵犯，均属于对本平台运营方权利的侵犯。</p>    <p><strong>第七条 用户个人信息保护</strong></p>    <p>7.1 用户应保证自己在登录使用本平台时用户身份信息的真实性、准确性及完整性，如果相关信息发生变化，用户应及时通过本平台变更。用户应当就用户身份信息的不真实、不准确、不完整承担责任。本平台不能也不会对个人信息的不真实、不准确，或个人信息未及时更新而引起的任何损失或损害承担责任。</p>    <p>7.2 用户未能按照本平台的要求和内容提供本平台要求的必要信息的，本平台有权中止本平台所提供的对应服务，由此所导致的任何已经或可能发生的损失，由用户自行承担，本平台并保留对该用户进行追索的权利。本平台有权对用户的信息及相关操作进行查阅，发现信息或相关操作中存在任何问题或怀疑，均有权向用户发出询问及要求改正的通知或者直接作出删除账户等处理。</p>    <p><strong>7.3 本平台非常重视用户个人信息的保护，通过本平台向用户提供服务时，将按照相关法律法规的规定收集、存储、使用、共享、转移、公开披露、保护和管理用户信息和隐私。本平台的隐私政策具体见《用户隐私政策》，用户同意仔细阅读并充分理解和接受该隐私政策，并同意该隐私政策作为本协议的重要组成部分。本平台将在停止运营时，停止继续收集个人信息活动，并通过通知或公告的形式告知用户。</strong></p>    <p><strong>第八条 违约责任</strong></p>    <p>8.1 双方应共同遵守本协议约定，如一方违约给对方造成损失的，违约方应赔偿守约方的损失。</p>    <p>8.2 除双方另有约定外，用户违反本协议中的义务、承诺、保证等的任意内容，本平台均有权就其违约情节，尤其是对本平台或相关第三方造成的损失，随时采取以下措施中的一种或多种：</p>    <p>（1）要求用户立即更换、修改相应内容；</p>    <p>（2）限制、中止用户使用相应服务；</p>    <p>（3）终止用户使用全部服务，终止本协议；</p>    <p>（4）依法追究用户的法律责任。</p>    <p>8.3 如用户因违反有关法律法规或者本协议，使本平台遭受任何损失，受到其他用户、任何第三方的索赔或任何行政管理部门的处罚，用户应对本平台或相关第三方的实际损失进行全额赔偿（包括合理的律师费用等必要费用）。</p>    <p><strong>第九条 责任限制</strong></p>    <p><strong>9.1 本平台不就通信系统或互联网的中断或无法运作、技术故障、计算机错误或终端病毒、信息损坏或丢失或其它在本平台合理控制范围之外的原因而产生的其他任何性质的破坏而向用户或任何第三方承担赔偿责任。</strong></p>    <p><strong>9.2 本平台需要定期或不定期地对相关的信息网络系统、设备进行检修、维护或升级，如因此类情况而造成网络服务在合理时间内的中断，本平台无需为此承担任何责任，但本平台将尽可能事先进行通知。</strong></p>    <p><strong>9.3 本平台将致力于提供快捷、准确的平台功能服务；但因网络环境、信息交互时延等客观因素，本平台不保证用户在使用本平台时在操作上不会中断或没有错误，不保证能及时纠正本平台所有缺陷，不保证本平台能满足用户的所有要求，亦不保证用户能通过本平台订购所有本平台内运营者的业务和产品，对网络服务的及时性、安全性、准确性也都不作担保。</strong></p>    <p><strong>9.4 用户通过本平台进行积分兑换服务而发生的所有税费及有关费用，均由用户承担。本平台提醒用户应该通过自己的谨慎判断确定相关服务及相关信息的准确新、真实性、合法性和有效性。</strong></p>   <p><strong>第十条 网络服务的停止</strong></p>    <p>10.1 在以下情形下，本平台有权停止对用户提供网络服务，且无需通知用户或取得用户同意:</p>    <p>(1)如用户是通过手机号码及车牌号/或短信验证码登录的，当该用户所对应的手机号码停机或销号后；</p>    <p>(2)用户违反本协议规定使用网络服务；</p>    <p>(3)用户提供的身份信息等资料不真实；</p>    <p>(4)用户账户被删除。</p>    <p>10.2 用户不同意本协议的内容及本平台对本协议的后续修改，应当停止使用本平台的网络服务。用户如对本平台的服务不满意，可以停止使用本平台的网络服务，或通知本平台停止对该用户的服务。</p>    <p>10.3、用户服务停止后，本平台没有义务向该用户或第三方传送任何未处理的信息或未完成的服务，亦无需对该用户或第三方负责。但本协议的终止并不意味着终止前所发生的未完成用户指令的撤销，也不能消除因终止前的交易所带来的法律后果。</p>    <p><strong>第十一条 其他功能应用或服务提供</strong></p>    <p>11.1 从本平台链接至本平台以外的功能应用或服务：某些情况下，本平台会提供跳转至其它功能应用或服务。此功能应用或服务将会引导用户到第三方发行或经营的应用或服务界面，仅为方便用户的使用需求快捷满足。</p>    <p>11.2 从本平台链接至本平台内其它应用或服务，其他应用或服务各自制定使用条款，条款可能互有差异，用户应先仔细查阅适用的使用条款，然后方可使用相关的应用或服务。</p>    <p><strong>第十二条 通知</strong></p>    <p>12.1 本平台对于用户的所有通知均可通过用户授权的任一联系方式（包括但不限于微信服务通知、手机号码）或者本平台公告的方式送达。该等通知于发送之日视为已送达用户。</p>    <p><strong>第十三条 协议范围及协议变更</strong></p>    <p>13.1 本协议包括《用户服务协议》正文以及所有本平台已经发布的或将来可能发布的各类规则、通知、公告等（统称&ldquo;规则&rdquo;）。所有规则为本协议不可分割的组成部分，与本协议正文具有同等法律效力。</p>    <p>13.2 本协议仅适用于通过本平台提供的服务，不适用于通过其他平台（包括但不限于网站、APP等）提供的服务。本平台有权根据法律法规变化和运营需要，不时地制定、修改本协议条款和/或各类规则。本协议及/或各类规则如有任何变更，将以本平台公示方式进行公告，而不再单独通知用户。用户如果不同意相关变更，应立即停止使用本平台提供的网络服务。如果用户继续享用本平台服务，则视为用户对修改后的协议和规则的同意和遵守。</p>    <p><strong>第十四条 法律适用与争议解决</strong></p>    <p>14.1 本协议之效力、解释、变更、履行与争议解决均适用中华人民共和国（为本协议之目的，不含香港、澳门、台湾地区）法律法规。</p>    <p>14.2 因双方就本协议的签订、履行或解释发生争议，双方应持平等、友好、争取合理解决问题的态度协商解决；<strong>如协商未成，任何一方均应向本平台运营方所在地人民法院提起诉讼。</strong></p>    <p>&nbsp;</p>'
		)
</script>

<style lang="scss" scoped>
	.wxParse {
		width: 100%;
		padding: 0 20rpx;
		box-sizing: border-box;
		color: #333;
	}

	.custom-rich-text {
		p {
			font-size: 28rpx;
			display: block;
			line-height: 50rpx;
		}
		::v-deep {
			p {
				font-size: 28rpx;
				display: block;
				line-height: 50rpx;
			}
		}
	}

	

	.wxParse-p {
		font-size: 28rpx;
		display: block;
		line-height: 50rpx;
		padding: 0;
		margin-top: 0;
		border-top: none;
		border-left: none;
		border-bottom: none;
	}
</style>